Documents/Renault_ВводПланаПродаж.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_ВводПланаПродаж</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Renault_ПланПродаж</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭтапПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ЭтапыПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ТипыПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_НастройкиПланаПродаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланПродаж</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДилерскиеЦентры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отделы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_Отделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Менеджеры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипыМоделей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ТипыМоделей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоRenault</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГаммаМоделей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ГаммаМоделей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/Renault_ТипыПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_ТипыПериода</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_ВводПланаПродаж/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Объект.Период = ПолучитьДатуПериода (Объект.Период);
КонецПроцедуры

&НаКлиенте
функция ПолучитьДатуПериода (ДатаПериода);
	Если Объект.ТипПериода = ПредопределенноеЗначение("Перечисление.Renault_ТипыПериода.Неделя") Тогда 
		Возврат НачалоНедели(ДатаПериода);
	ИначеЕсли Объект.ТипПериода = ПредопределенноеЗначение("Перечисление.Renault_ТипыПериода.Месяц") Тогда
		Возврат НачалоМесяца(ДатаПериода);
	ИначеЕсли Объект.ТипПериода = ПредопределенноеЗначение("Перечисление.Renault_ТипыПериода.Квартал") Тогда
		Возврат НачалоКвартала(ДатаПериода);
	ИначеЕсли Объект.ТипПериода = ПредопределенноеЗначение("Перечисление.Renault_ТипыПериода.Год") Тогда
		Возврат НачалоГода(ДатаПериода);
	Иначе
		Возврат Дата(1,1,1);
	КонецЕсли;
КонецФункции
